import sliderApi from 'assets/js/api/sliderApi'
/**
 * slider侧边栏
 */
const slider = {
    state: {
        quotes: [
            "The more a man learns, the more he sees his ignorance",
            "我努力的奔跑,  只为追上那个曾经被寄予厚望的自己",
            "君以国士待我, 我必国士报之",
            "不要证明别人错了，去让他们相信你是对的",
            "我和别人打赌，赢了一瓶酒。你们心安理得的喝着这酒，说着：反正是白送的。那么是否真的明白我输了也是要送出一瓶酒",
            "好像突然有了软肋，也突然有了铠甲",
            "我虽然不同意你的观点，但我誓死捍卫你说话的权利",
            "人面不知何处去，桃花依旧笑春风",
            "低头弄莲子，莲子清如水",
            "一念起,万水千山;一念灭,沧海桑田",
            "桃花坞里桃花庵，桃花庵里桃花仙。桃花仙人种桃树，又摘桃花换酒钱",
            "酒醒只在花前坐，酒醉还来花下眠。半醒半醉日复日，花落花开年复年",
            "但愿老死花酒间，不愿鞠躬车马前。车尘马足富者趣，酒盏花枝贫者缘",
            "若将富贵比贫者，一在平地一在天。若将贫贱比车马，他得驱驰我得闲",
            "别人笑我忒风颠，我笑他人看不穿。不见五陵豪杰墓，无花无酒锄作田",
            "锦瑟无端五十弦，一弦一柱思华年。庄生晓梦迷蝴蝶，望帝春心托杜鹃。沧海月明珠有泪，蓝田日暖玉生烟。此情可待成追忆，只是当时已惘然。",
            "云母屏风烛影深，长河渐落晓星沉。嫦娥应悔偷灵药，碧海青天夜夜心",
            "今晚的月色真美",
            "青青子吟，悠悠我心。纵我不往，子宁不嗣音",
            "海上月是天上月,眼前人是心上人",
            "红衣佳人白衣友，朝与同歌暮同酒",
            "世人谓我恋长安，其实只恋长安某",
            "妖，异于常态即为妖。魔，心存恶念即成魔。",
            "鬼，超出人常即化鬼。怪，因果不接即称怪。",
            "读书是为了心平气和的和傻逼说话，健身是为了让傻逼心平气和的和你说话",
            "去年元夜时，花市灯如昼。月上柳梢头，人约黄昏后。今年元夜时，花与灯依旧。不见去年人，泪满春衫袖",
            "一见短袖子立刻想到白臂膊，立刻想到全裸体，立刻想到生殖器，立刻想到性交，立刻想到杂交，立刻想到私生子。中国人的想像惟在这一层能够如此跃进"
        ]
    },
    mutations: {
        SETQUOTES: (state, par) => {
            state.quotes = par;
        }
    },
    actions: {
        getQuotes({commit}, par) {
            return new Promise((resolve, reject) => {
                sliderApi.getQuotes(par).then((data) => {
                    commit('SETQUOTES', data);
                    resolve(data);
                })
            })
        }
    }
};

export default slider;